Revit 2027 API
BuiltInFailures.GenericFailures.ElementsInInvalidContext Property
 There are elements in the document that exist in a context they should not. These elements must be deleted to continue using this project or family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementsInInvalidContext { get; }
Public Shared ReadOnly Property ElementsInInvalidContext As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementsInInvalidContext {
	FailureDefinitionId^ get ();
}
static member ElementsInInvalidContext : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GenericFailures Class
Autodesk.Revit.DB Namespace